spirit0908/STM32/main.c
    /* CAN RS */
    /* Configure PB.5 as Push-Pull Output */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_Init(GPIOB, &GPIO_InitStructure);


    /* IO */

    /* Configure PA.0 as Input - PushButton UP */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    /* Configure PA.1 as Input - PushButton RIGHT */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    /* Configure PC.14 as Input - PushButton DOWN */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_14;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
    GPIO_Init(GPIOC, &GPIO_InitStructure);

    /* Configure PC.15 as Input - PushButton LEFT */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
    GPIO_Init(GPIOC, &GPIO_InitStructure);

    /* Configure PA.4 as Output - PushButton Relay1 */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    /* Configure PA.5 as Output - PushButton Relay2 */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
}


/*******************************************************************************
 * Function Name  : SerialInit
 * Description    : Initializes the serial link.
 * Input          : None
 * Output         : None
 * Return         : None
 *******************************************************************************/
void SerialInit(void)
{
    USART_InitTypeDef USART_InitStruct;

    /* *** USART1 *** */
    /* Enable USART1 clock */
    RCC_APB1PeriphClockCmd(RCC_APB2Periph_USART1, DISABLE);

    /* Enable USART  */
    USART_StructInit(&USART_InitStruct);
    USART_Cmd(USART1, DISABLE);
    USART_Init(USART1, &USART_InitStruct);

    /* Enable IT on USART handler */
    USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);
    USART_ITConfig(USART1, USART_IT_TXE, DISABLE);
    USART_ITConfig(USART1, USART_IT_TC, DISABLE);


    /* *** USART2 *** */
    /* Enable USART2 clock */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);

    /* Enable USART  */
    USART_StructInit(&USART_InitStruct);
    USART_Cmd(USART2, ENABLE);
    USART_Init(USART2, &USART_InitStruct);

    /* Enable IT on USART handler */
    USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);
    USART_ITConfig(USART2, USART_IT_TXE, DISABLE);
    USART_ITConfig(USART2, USART_IT_TC, DISABLE);


    /* *** USART3 *** */
    /* Enable USART3 clock */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);

    /* Configure UART for EDF Teleinfo */
    USART_InitStruct.USART_BaudRate     = 0x04B0; /* 1200 Baud */
    USART_InitStruct.USART_WordLength   = USART_WordLength_8b;
    USART_InitStruct.USART_StopBits     = USART_StopBits_1;
    USART_InitStruct.USART_Parity       = USART_Parity_Even;
    USART_InitStruct.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    USART_InitStruct.USART_Mode         = USART_Mode_Rx;    /* Only Rx pin is configured */
    USART_InitStruct.USART_Clock        = USART_Clock_Disable;
    USART_InitStruct.USART_CPOL         = USART_CPOL_Low;
    USART_InitStruct.USART_CPHA         = USART_CPHA_1Edge;
    USART_InitStruct.USART_LastBit      = USART_LastBit_Disable;

    /* Enable USART  */
    USART_Cmd(USART3, ENABLE);
    USART_Init(USART3, &USART_InitStruct);

    /* Enable IT on USART handler */
    USART_ITConfig(USART3, USART_IT_RXNE, DISABLE);
    USART_ITConfig(USART3, USART_IT_TXE, DISABLE);
    USART_ITConfig(USART3, USART_IT_TC, DISABLE);
}


/*******************************************************************************
 * Function Name  : SpiInit
 * Description    : Initializes the SPI link.
 * Input          : None
 * Output         : None
 * Return         : None
 *******************************************************************************/
//void SpiInit(void)
//{
//    SPI_InitTypeDef SPI_InitStruct;
//
//    /* *** SPI1 *** */
//    /* Enable SPI1 clock */
//    RCC_APB1PeriphClockCmd(RCC_APB2Periph_SPI1, ENABLE);
//
////    PORT.GPIO_Mode  = GPIO_Mode_AF_PP;
////    PORT.GPIO_Speed = GPIO_Speed_50MHz;
////    PORT.GPIO_Pin   = GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
////    GPIO_Init(GPIOB, &PORT);
//
//    /* Initialize SPI1 with default parameter*/
//    SPI_Init(SPI1, SPI_InitStruct);
//
//    /* Configure SPI1 for nRF24L01 */
//    SPI_InitStruct.SPI_Mode = SPI_Mode_Master;
//    SPI_InitStruct.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_2;
//    SPI_InitStruct.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
//    SPI_InitStruct.SPI_CPOL = SPI_CPOL_Low;
//    SPI_InitStruct.SPI_CPHA = SPI_CPHA_1Edge;
//    SPI_InitStruct.SPI_CRCPolynomial = 7;
//    SPI_InitStruct.SPI_DataSize = SPI_DataSize_8b;
//    SPI_InitStruct.SPI_FirstBit = SPI_FirstBit_MSB;
//	SPI_InitStruct.SPI_NSS = SPI_NSS_Soft;
//
//    /* Enable SPI1 */
//	SPI_Init(SPI1, &SPI_InitStruct);
//	SPI_NSSInternalSoftwareConfig(SPI1, SPI_NSSInternalSoft_Set);
//    SPI_Cmd(SPI1, ENABLE);
//
//    /* Enable IT on SPI1 handler */
//    USART_ITConfig(SPI1, SPI_IT_RXNE, DISABLE);
//    USART_ITConfig(SPI1, SPI_IT_TXE, DISABLE);
//    USART_ITConfig(SPI1, SPI_IT_ERR, DISABLE);
//
//
//
//    /* *** SPI2 *** */
//    /* Enable SPI2 clock */
//	RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI2, DISABLE);
//
//    /* Initialize SPI2 with default parameter*/
////    SPI_Init(SPI2, SPI_InitStruct);
//
//    /* Configure SPI2 */
//    SPI_InitStruct.SPI_Mode = SPI_Mode_Master;
//    SPI_InitStruct.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_2;
//    SPI_InitStruct.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
//    SPI_InitStruct.SPI_CPOL = SPI_CPOL_Low;
//    SPI_InitStruct.SPI_CPHA = SPI_CPHA_1Edge;
//    SPI_InitStruct.SPI_CRCPolynomial = 7;
//    SPI_InitStruct.SPI_DataSize = SPI_DataSize_8b;
//    SPI_InitStruct.SPI_FirstBit = SPI_FirstBit_MSB;
//    SPI_InitStruct.SPI_NSS = SPI_NSS_Soft;
//
//    /* Enable SPI2 */
//   	USART_Init(SPI2, &SPI_InitStruct);
//   	SPI_NSSInternalSoftwareConfig(SPI2, SPI_NSSInternalSoft_Set);
//	SPI_Cmd(SPI2, DISABLE);
//
//    /* Enable IT on SPI2 handler */
//    USART_ITConfig(SPI2, SPI_IT_RXNE, DISABLE);
//    USART_ITConfig(SPI2, SPI_IT_TXE, DISABLE);
//    USART_ITConfig(SPI2, SPI_IT_ERR, DISABLE);
//
//}


