spirit0908/STM32/main.c
    LcdGotoXYFont(0,1);
    LcdStr(FONT_1X, (unsigned char *)"PTEC:");

    LcdGotoXYFont(6,1);
    LcdStr(FONT_1X, (unsigned char *) &(TIC_info.PTEC[0]) );

    LcdGotoXYFont(0,2);
    LcdStr(FONT_1X, (unsigned char *)"HCHC:");

    LcdGotoXYFont(5,2);
    LcdStr(FONT_1X, (unsigned char *) &(TIC_info.HCHC[0]) );

    LcdGotoXYFont(0,3);
    LcdStr(FONT_1X, (unsigned char *)"HCHP:");

    LcdGotoXYFont(5,3);
    LcdStr(FONT_1X, (unsigned char *) &(TIC_info.HCHP[0]) );

    LcdGotoXYFont(0,4);
    LcdStr(FONT_1X, (unsigned char *)"IINST:");

    LcdGotoXYFont(7,4);
    LcdStr(FONT_1X, (unsigned char *) &(TIC_info.IINST[0]) );

    LcdUpdate();
}


/*******************************************************************************
 * Function Name  : PWMInit
 * Description    : Initializes the PWM.
 * Input          : None
 * Output         : None
 * Return         : None
 *******************************************************************************/
void PWMInit(void)
{
    TIM_TimeBaseInitTypeDef timer;
    TIM_OCInitTypeDef timerPWM1, timerPWM2, timerPWM3;

    /* Enable peripheral clock for TIMER 3 */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);

    /* Initialize TIMER 3 */
    TIM_TimeBaseStructInit(&timer);
    timer.TIM_Prescaler = 720;
    timer.TIM_Period = PERIOD;
    timer.TIM_ClockDivision = 0;
    timer.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInit(TIM3, &timer);

    /* Configure TIM3 - Ch1 */
    TIM_OCStructInit(&timerPWM1);
    timerPWM1.TIM_OCMode = TIM_OCMode_PWM1;
    timerPWM1.TIM_Channel = TIM_Channel_1;
    timerPWM1.TIM_Pulse = 1000; //0;
    timerPWM1.TIM_OCPolarity = TIM_OCPolarity_High;

    /* Configure TIM3 - Ch2 */
    TIM_OCStructInit(&timerPWM2);
    timerPWM2.TIM_OCMode = TIM_OCMode_PWM1;
    timerPWM2.TIM_Channel = TIM_Channel_2;
    timerPWM2.TIM_Pulse = 1000;
    timerPWM2.TIM_OCPolarity = TIM_OCPolarity_High;

    /* Configure TIM3 - Ch3 */
    TIM_OCStructInit(&timerPWM3);
    timerPWM3.TIM_OCMode = TIM_OCMode_PWM1;
    timerPWM3.TIM_Channel = TIM_Channel_3;
    timerPWM3.TIM_Pulse = 1000;
    timerPWM3.TIM_OCPolarity = TIM_OCPolarity_High;

    /* Init timer */
    TIM_OCInit(TIM3, &timerPWM1);
    TIM_OCInit(TIM3, &timerPWM2);
    TIM_OCInit(TIM3, &timerPWM3);

    /* Reinitialize timer values */
    TIM3->CCR1 = 0; //Pulse Red
    TIM3->CCR2 = 0; //Pulse Green
    TIM3->CCR3 = 0; //Pulse Blue

    /* Enable TIM3 */
    TIM_Cmd(TIM3, ENABLE);
}


/*******************************************************************************
 * Function Name  : RCC_Configuration
 * Description    : Configures the different system clocks.
 * Input          : None
 * Output         : None
 * Return         : None
 *******************************************************************************/
void RCC_Configuration(void)
{
    /* RCC system reset(for debug purpose) */
    RCC_DeInit();

    /* Enable HSE */
    RCC_HSEConfig(RCC_HSE_ON);

    /* Wait till HSE is ready */
    HSEStartUpStatus = RCC_WaitForHSEStartUp();

    if (HSEStartUpStatus == SUCCESS) {
        /* Enable Prefetch Buffer */
        FLASH_PrefetchBufferCmd(FLASH_PrefetchBuffer_Enable);

        /* Flash 2 wait state */
        FLASH_SetLatency(FLASH_Latency_2);

        /* HCLK = SYSCLK */
        RCC_HCLKConfig(RCC_SYSCLK_Div1);

        /* PCLK2 = HCLK */
        RCC_PCLK2Config(RCC_HCLK_Div1);

        /* PCLK1 = HCLK/2 */
        RCC_PCLK1Config(RCC_HCLK_Div2);

        /* PLLCLK = 8MHz * 9 = 72 MHz */
        RCC_PLLConfig(RCC_PLLSource_HSE_Div1, RCC_PLLMul_9);

        /* Enable PLL */
        RCC_PLLCmd(ENABLE);

        /* Wait till PLL is ready */
        while (RCC_GetFlagStatus(RCC_FLAG_PLLRDY) == RESET) {
        }

        /* Select PLL as system clock source */
        RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK);

        /* Wait till PLL is used as system clock source */
        while (RCC_GetSYSCLKSource() != 0x08) {
        }
    }
}


/*******************************************************************************
 * Function Name  : NVIC_Configuration
 * Description    : Configures Vector Table base location.
 * Input          : None
 * Output         : None
 * Return         : None
 *******************************************************************************/
void NVIC_Configuration(void) 
{
#ifdef  VECT_TAB_RAM  
    /* Set the Vector Table base location at 0x20000000 */
    NVIC_SetVectorTable(NVIC_VectTab_RAM, 0x0);
#else  /* VECT_TAB_FLASH  */
    /* Set the Vector Table base location at 0x08000000 */
    NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x0);
#endif
}

/*******************************************************************************
 * Function Name  : Delay
 * Description    : Inserts a delay time.
 * Input          : nCount: specifies the delay time length.
 * Output         : None
 * Return         : None
 *******************************************************************************/
void Delay(vu32 nCount) 
{
    for (; nCount != 0; nCount--)
        ;
}

#ifdef  DEBUG
/*******************************************************************************
 * Function Name  : assert_failed
 * Description    : Reports the name of the source file and the source line number
 *                  where the assert_param error has occurred.
 * Input          : - file: pointer to the source file name
 *                  - line: assert_param error line source number
 * Output         : None
 * Return         : None
 *******************************************************************************/
void assert_failed(u8* file, u32 line)
{
    /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

    /* Infinite loop */
    while (1)
    {
    }
}
#endif



/******************* (C) COPYRIGHT 2007 STMicroelectronics *****END OF FILE****/
